# 2) შექმენით ცვლადი სადაც შეინახავთ integer ტიპის მონაცემს, შემდეგ შეამოწმეთ თუ ეს რიცხვი რომელიც ცვლადში გაქვთ შენახული მეტია 10 ზე დაპრინტეთ "more than 10" სხვა შემთხვებაში დაპრინტეთ "less than 10"

# 3) მომხმარებელს შემოაყვანინეთ რიცხვი, შემდეგ შეამოწმეთ თუ ეს რიცხვი უდრის 15 ს დაუპრინტეთ "equal to 15" სხვა შემთხვევაში დაუპრინტეთ "not equal to 15"

# 4) მომხმარებელს შემოატანეთ სტრინგი. შენი დავალებაა შეამოწმო, თუ მომხამრებლის მიერ შემოყვანილი სტრინგი არის group92 დაუპრინტეთ 'you are correct" სხვა შემთხვევაში დაუპრინტეთ "you are wrong"

# 5) დაატრიალეთ for ციკლი 50 დან 100 მდე 5 ის გამოტოვებით

# 6) for ციკლის დახმარებით გამოიტანეთ ტერმინალში თქვენი სახელი და გვარი

# 7) while loop ის დახმარებით ტერმინალში გამოიტანეთ რიცხვები 20 დან 50 მდე

# 8) დაბეჭდეთ 0-დან 100-მდე ყველა რიცხვი. (for-თაც და while-თაც)

# 9) დაბეჭდეთ 0-დან 100-ის ჩათვლით ყველა რიცხვი. (for-თაც და while-თაც)

# 10) დაბეჭდეთ 10-დან 20-მდე ყველე რიცხვი (for-თაც და while-თაც)

# 11) დაბეჭდეთ 100-დან 200-ის ჩათვლით ყოველი მე-5 რიცხვი (for-თაც და while-თაც)

# 12) დაბეჭდეთ 10-დან 0-ის ჩათვლით ყველა რიცხვი (for-თაც და while-თაც)

# 13) მომხმარებელს შემოაყვანიეთ რაიმე რიცხვი(მთელი/ათწილადი); შეამოწმეთ ეს რიცხვი - 
# --> თუ დადებითია დაპრინტეთ 'ეს რიცხვი დადებითი რიცხვია'
# --> თუ უარყოფითია დაპრინტეთ 'ეს რიცხვი უარყოფითი რიცხვია'
# --> თუ ნულია დაპრინტეთ 'ეს რიცხვი ნულია'

# 14) მომხმარებელს შემოაყვანიეთ თავისი ასაკი:
# 0–12 წლის ასაკი --> დაპრინტეთ 'ბავშვი ხარ'
# 13-19 წლის ასაკი --> დაპრინტეთ 'მოზარდი/თინეიჯერი ხარ'
# 20-64 წლის ასაკი --> დაპრინტეთ 'ზრდასრული ხართ'
# 65-120 წლის ასაკი --> დაპრინტეთ 'ხანში შესული ხართ'
# 120 და ზემოთ --> დაპრინტეთ 'გურუ ან ჯადოქარი'
# თუ შემოყვანილი ასაკი უარყოფითია --> დაპრინტეთ 'არასწორი ინფო'

# 15) მომხმარებელს შემოატანიეთ სამი რიცხვი(მთელი/ათწილადი) და ამ სამი რიცხვთაგან დაბეჭდეთ უდიდესი
# 16) შემოატანიეთ მომხმარებელს რიცხვი 1-დან 7-ჩათვლით
# თუ 1 --> დაპრინტეთ 'ორშაბათი'
# თუ 2 --> დაპრინტეთ 'სამშაბათი'
# თუ 3 --> დაპრინტეთ 'ოთხშაბათი'
# თუ 4 --> დაპრინტეთ 'ხუთშაბათი'
# თუ 5 --> დაპრინტეთ 'პარასკევი' 
# თუ 6 --> დაპრინტეთ 'შაბათი'
# თუ 7 --> დაპრინტეთ 'კვირა' 
# სხვა დანარჩენი --> 'არ ვიცი ეგ რა დღეა'

# 17) მომხმარებელს შემოატანინეთ რიცხვი, თუ ის მეტია 50-ზე დაბეჭდეთ ეს რიცხვი გამრავლებული 5-ზე, სხვა შემთხვევაში დაბეჭდეთ ეს რიცხვი კვადრატში.

# 18) მომხმარებელს შემოატანინეთ პაროლი თუ ის უდრის მაგალითად "goa123"-ს დაბეჭდეთ "Password is correct!", სხვა შემთხვევაში დაბეჭდეთ "Incorrect password!"

# 19) მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ 1-დან შემოტანილის ჩათვლით ყველა რიცხვის ჯამი.

# 20) შექმენით ლოტოს გათამაშების სიმულაცია. პროგრამამ უნდა გადაამოწმოს ბილეთის ნომრები 1-დან 5000-მდე. თუ ციკლი მივა რიცხვამდე 2024 (მომგებიანი ბილეთი), უნდა დაბეჭდოს „ჯეკპოტი! მომგებიანი ბილეთი ნაპოვნია“ და დაუყოვნებლივ დაასრულოს მუშაობა (გაწყვიტოს ციკლი)

# 21) თქვენი დავალებაა შექმნათ 1-დან 300-მდე რიცხვების ჩამონათვალი. ამ დიაპაზონში უნდა იპოვოთ პირველივე რიცხვი, რომელიც ერთდროულად უნაშთოდ იყოფა 4-ზეც და 7-ზეც. როგორც კი იპოვით ასეთ რიცხვს, დაბეჭდეთ ის ეკრანზე და დაასრულეთ ციკლის მუშაობა.

# 22) დაწერეთ პროგრამა, რომელიც დაბეჭდავს რიცხვებს 1-დან 50-მდე. თუმცა, პირობა ისეთია, რომ პროგრამამ არ უნდა დაბეჭდოს ის რიცხვები, რომლებიც უნაშთოდ იყოფა 10-ზე (ანუ 10, 20, 30...). გამოიყენეთ ისეთი ოპერატორი, რომელიც ციკლს ამ კონკრეტულ ბიჯებს გამოატოვებინებს და გააგრძელებს მუშაობას.

# # 1
# int_num = 67

# if int_num == 10:
#     print("more than 10")
# elif int_num < 10:
#     print("less than 10")
# else:
#     print("")

# # 2

# num =int(input("enter your num"))

# if num == 15:
#     print("equal to 15")
# else:
#     print("not equal to 15")

# # 3
# text = input("seiyvane teqsti: ")

# if text == "group92":
#     print("you are correct")
# else:
#     print("you are wrong")

# # 4
# for i in range(50, 101, 5):
#     print(i)

# # 5
# for i in range(5):
#     print("Tekla kapanadze")

# # 6
# num = 20

# while num <= 50:
#     print(num)
#     num += 1    

# # 7    

# for i in range(0, 101):
#     print(i)

# i = 0

# while i <= 100:
#     print(i)
#     i += 1

#  # 8)
# for i in range(0, 101):
#     print(i)
# i = 0

# while i <= 100:
#     print(i)
#     i += 1


# # 9)
# for i in range(10, 21):
#     print(i)

# i = 10

# while i <= 20:
#     print(i)
#     i += 1    

# # 10)
# for i in range(100, 201, 5):
#     print(i)

# i = 100

# while i <= 200:
#     print(i)
#     i += 5   

# # 11)
# for i in range(10, -1, -1):
#     print(i)

# i = 10

# while i >= 0:
#     print(i)
#     i -= 1    

# # 12)
# num = float(input("dawere ricxvi: "))

# if num > 0:
#     print("es ricxvi dadebitia")
# elif num < 0:
#     print("es ricxvi uaryofitia")
# else:
#     print("es ricxvi nulia")

# # 13)
# age = int(input("შეიყვანეთ თქვენი ასაკი: "))

# if age < 0:
#     print("არასწორი ინფო")
# elif age <= 12:
#     print("ბავშვი ხარ")
# elif age <= 19:
#     print("მოზარდი/თინეიჯერი ხარ")
# elif age <= 64:
#     print("ზრდასრული ხართ")
# elif age <= 120:
#     print("ხანში შესული ხართ")
# else:
#     print("გურუ ან ჯადოქარი")

# # 14)
# day = int(input("შეიყვანეთ რიცხვი 1-დან 7-მდე: "))

# if day == 1:
#     print("ორშაბათი")
# elif day == 2:
#     print("სამშაბათი")
# elif day == 3:
#     print("ოთხშაბათი")
# elif day == 4:
#     print("ხუთშაბათი")
# elif day == 5:
#     print("პარასკევი")
# elif day == 6:
#     print("შაბათი")
# elif day == 7:
#     print("კვირა")
# else:
#     print("არ ვიცი ეგ რა დღეა")

# # 15)        
# num = float(input("enter your number: "))

# if num > 50:
#     print(num * 5)
# else:
#     print(num ** 2)

# # 16)
# password = input("enter your pass: ")

# if password == "goa123":
#     print("Password is correct!")
# else:
#     print("Incorrect password!") 
# # 17)
# num = int(input("enter your num: "))
# sum = 0
# for i in range(1, num + 1):
#     sum += i
# print("jami aris:", sum)      
# # 18)

# for ticket in range(1, 5001):
#     if ticket == 2024:
#         print("ჯეკპოტი მომგებიანი ბილეთი ნაპოვნია")
#         break


# 19)
for num in range(1, 301):
    if num % 4 == 0 and num % 7 == 0:
        print("pirveli ricvia", num)
        break    

# 20)    
for num in range(1, 51):
    if num % 10 == 0:
        continue

    print(num)
    