# 1) შექმენით 5 ელემენტიანი სია, სადაც ჩაწერთ თქვენს საყვარელი მანქანების სახელს. ბოლოს გამოიტანეთ სიაში მყოფი პირველი და მესამე მნიშვნელობა. (დადებითი index-ებით)
# 2) შექმენით რიცხვების სია, სადაც ჩაწერთ 0-დან 10-ის ჩათვლით ყველა ლუწ რიცხვს. ბოლოს გამოიტანეთ სიაში მყოფი მეორე და მეოთხე მნიშვნელობა. (აურყოფითი index-ებით)
# 3) შექმენით 5 ელემენტიანი სია და დაბეჭდეთ მისი მე-4 ელემენტი. (any index)
# 1)
# cars = ["BMW", "Mercedes", "Audi", "lambogin", "Porsche"]
# print(cars[0])
# print(cars[2])
# 2)
# numbers = [0, 2, 4, 6, 8, 10]
# print(numbers[-5])
# print(numbers[-3]) 
# 3)
# my_list = ["vasli", "pomelo", "bali", "nesvi", "sazamtro"]
# print(my_list[3])