# 2) კომენტარებით ახსენით რა არის სია და როგორ უნდა შევქმნათ ის python-ში.
# 3) კომენტარებით ახსენით რა არის index-ი.
# 4) შექმენით 7 ელემენტიანი სახელების სია, შეცვალეთ 1-ლი და მე-5 ინდექსზე მდგომი ელემენტების მნიშვნელობა.
# 5) შექმენით სია და შეიტანეთ შიგნით სხვადასხვა ელემენტები და გამოიტანეთ მე-2 ,მე-4 და მე-6 ელემენტები და ახსენით როგორ გამოგაქვთ.
# 6) კომენტარებით ახსენით ასევე განსხვავება list-ს და ცვლადს შორის.


# 1)
# სია არის დიდი ყუთი სადაც სხვადასხვა მონაცემებს ვინახავთ ეს შეიძლება იყოს str,int,float,boolen ი და ა.შ.შ
# 2) index არის უკვე ნომინაცია ანუ სიტყვებს აქვთ მინიჭებული შესაბამისი თანმიმდევრობა რონელიც 0 იდან იწყება
# 3)
saxelebi = ["ana","giorgi","nino","levani","mariami","daviti","tamari"]

saxelebi[1] ="saba"      
saxelebi[5] ="elene"    
print(saxelebi)
# 4)
cars = ["mercedes","bmw","lamborngin","nissan","ferrari","toyota"]
print(cars[2])
print(cars[-2])
print(cars[-1])

# ესეიგი პირველ რიგშ შევქმენით სია სადაც მანქანის ბრენდები შევიყვანეთ შემდეგ გამოვიძახე პრინტი სადაც index 
# ნომინაციის მეშვეობით დავბეჭდე ხილი

# 5)
# list ში უფრო მეტი ინფოტმაციის შენახვა შეგვიძლია ხოლო ცვლადშ მარტო ერთის