# 2) კომენტარის სახით ახსენით თუ რა არიან string ები
# 3) კომენტარის სახით ახსენით თუ რა არიან integer ები
# 4) კომენტარის სახით ახსენით თუ რა არის მნიშვნელობის გადაწერა
# 5) შექმენით 5 ცვლადი სადაც შეინახავთ: თქვენს სახელს, გვარს, ასაკს, დაბადების თარიღს, და საყვარელ სპორტს, შემდეგ კი დაპრინტავთ ყველაფერს ერთად (ცვლადების გარეშე გაკეთებული დავალება არ ჩაითვლება)
# 6) გააკეთეთ მნიშვნელობის გადაწერის 2 მაგალითი
# 7) შექმენით 2 ცვლადი, num1 და num2, და მოახდინეთ ყველა მათემატიკური ოპერაცია ამ ორ რიცხვს შორის (+, -, *, /)

# 2)სტრინგები არის მონაცემთა ერთ ერთი ტიპი რომელსაც სჭირდება ბრჭყალები 
# 3) ინტეჯერები არის მთელი რიცხვები ანუ ისეთი რიცხვები რომელიც არარის ათწილადი ანუ ესეთი რიცხვებია
# 7,8,9 ამ რიცხვებს კი ბრჭყალები არ სჭირდებათ 
# 4) მნიშვნელობის გადაწერაა მაგალითად როდესაც ცვლადში შევინახავთ სახელს( ან რაიმეს რაც გვინდა) და მაგალითად ამ
# ცვლადს დავრქმევთ t ს და შემდეგ იგივე იგვე რამეს როცა დავწერთ ქვემოთ ცვლადის სახელს დავტოვებთ უბრალოდ
# მნიშვნელობას შევუცვლით მაგალითად
# t = tekla
# t = kapanadze
# 5) 
name = "Tekla"
first_name = "kapanadze"
age = 11
date_of_birth = "19/01/2015"
fav_sport = "football"
print(name, first_name, age, date_of_birth, fav_sport)

# 6)
name = "tekla"
name = "anastasia"
print(name)

# 7)
num_1 = 47
num_2 = 89
print(num_1 + num_2)
print(num_2 - num_1)
print(num_1 * num_2)
print(num_1 / num_2)

