# 1) კომენტარებით ახსენით რა არის ფუნქცია
# 2) კომენტარებით ახსენით როგორი ფუნქციაა print() (დღეს გაკვეთილზე ნასწავლიდან გამომდინარე)
# 3) კომენტარების სახით ახსენით რა არის არგუმენტები
# 4) კომენტარების სახით ახსენით თუ რასაკეტებს .upper(), .lower(), .capitalize()
# 5) გააკეთეთ 2-2 მაგალითი .upper() .lower() .capitalize() ების გამოყენებით
# 6) კომენტარების სახით ახსენით თუ რასაკეთებს find() და გააკეთეთ 2 მაგალითი find() ის გამოყენებით
# 1) ფუნქცია არის კოდი, რომელიც რაღაც მოქმედებას ასრულებს
# 2) print() არის ფუნქცია რომელიც ეკრანზე ბეჭდავს ინფორმაციას
# 3) არგუმენტი არის მნიშვნელობა რომელსაც ფუნქციას ვაწვდით
# 4 upper არის ფუნქცია რომელიც ზრდის ყველა ასოს სიტყვაში
# lower არის როცა ყველა ასოს აპატარავებს ხოლო capiralize უკვე არის როცა პირველ ასოს ადიდებს
# 5)
# print("mgeli".upper())
# print("melakuda".upper())


# print("CAT".lower())
# print("DOG".lower())


# print("hTMl".capitalize())
# print("pYTHON".capitalize())

# 6)
# print("hello world".find("e"))
# print("i love programming".find("g"))