# 2) კომენტარებით ახსენით რა არის slicing.
# 3) შექმენი სია fruits = ["ვაშლი", "ბანანი", "ატამი", "მსხალი", "ალუბალი"] და დაბეჭდე მესამე ელემენტი
# 4) შექმენი სია numbers = [10, 20, 30, 40, 50], შეცვალე მეორე ელემენტი 25-ით და დაბეჭდე განახლებული სია
# 5) მომხმარებელს შეაყვანინე ინდექსი (`0`-დან `4`-მდე) და დაბეჭდე შესაბამისი ელემენტი სიიდან colors = ["წითელი", "მწვანე", "ლურჯი", "ყვითელი", "იასამნისფერი"]
# 6) შექმენი სია animals = ["ძაღლი", "კატა", "სპილო", "ვეფხვი", "ლომი"], შეცვალე ბოლო ელემენტი "გემი"-თ და დაბეჭდე სია
# 7) მომხმარებელს შეაყვანინე ინდექსი და ახალი ფერი, შეცვალე ამ ინდექსზე არსებული ფერი სიაში
# colors = ["თეთრი", "შავი", "ნარინჯისფერი", "ვარდისფერი"]` და დაბეჭდე განახლებული სია.
# 8) მოცემულია რიცხვების სია. გამოიყენეთ slicing-ის ბიჯი (step), რათა სიიდან ამოიღოთ ყოველი მეორე რიცხვი.
# -- numbers_step = [5, 10, 15, 20, 25, 30, 35, 40] --
# 9) მოცემულია ხილის სია. გამოიყენეთ slicing, რათა ამოჭრათ და მიიღოთ მხოლოდ შუაში მყოფი 3 ხილი.
# -- fruits = ["ვაშლი", "მსხალი", "ატამი", "ბალი", "ყურძენი", "ბანანი", "ფორთოხალი"] --
# 10) მოცემული გაქვთ რიცხვების სია. თქვენი დავალებაა for ციკლისა და if პირობის გამოყენებით სიაში იპოვოთ და დაბეჭდოთ მხოლოდ ლუწი (even) რიცხვები.
# -- mixed_nums = [12, 45, 8, 33, 91, 24, 10, 77] --


# 1)
# slicinf ი არის იგივე start stop და step ი
# 2)
# fruit = ["ვაშლი", "ბანანი", "ატამი", "მსხალი", "ალუბალი"]
# print(fruit[2])
# # 3)
# numbers = [10, 20, 30, 40, 50]
# numbers[1] = 25
# print(numbers)

# # 4
# colors = ["წითელი", "მწვანე", "ლურჯი", "ყვითელი", "იასამნისფერი"]

# i = int(input("შეიყვანე ინდექსი (0-დან 4-მდე): "))
# print(colors[i])
# # 5
# animals = ["ძაღლი", "კატა", "სპილო", "ვეფხვი", "ლომი"]
# animals[-1] = "გემი"
# print(animals)

# # 6
# colors = ["თეთრი", "შავი", "ნარინჯისფერი", "ვარდისფერი"]

# index = int(input("seiyvane index i 0 dan 3 amde:"))
# new_color = input("dawere axali feri:")
# if 0 <= index < len(colors):
#     colors[index] = new_color
#     print("ganaxlebulia sia", colors)
# else:
#     print("araswori index i")


# 7

# numbers_step = [5, 10, 15, 20, 25, 30, 35, 40]
# result = numbers_step[::2]
# print(result)

# 8
# fruits = ["ვაშლი", "მსხალი", "ატამი", "ბალი", "ყურძენი", "ბანანი", "ფორთოხალი"]
# middle = fruits[2:5]
# print(middle)

# 9
mixed_nums = [12, 45, 8, 33, 91, 24, 10, 77]
for num in mixed_nums:
    if num % 2 == 0:
        print(num)