# 1) ყველა მათემატიკურ ოპერატორზე გააკეთეთ 3 მაგალითი
# 2) კომენტარებით ახსენით თუ რა უნდა გავითვალისწინოთ ცვლადის შექმნისას
# პლუისი
print(11 + 12)
print(54 + 16)
print(59 + 34)
# მინუსი
print(23 - 22)
print(78 - 45)
print(87 - 28)

# გამრავლება ორი ნიშნით
print(44  2)
print(73  3)
print(67 ** 1)

# გამრავლება 1 ნიშნით
print(21 * 12)
print(78 * 3)
print(2 * 89)

# გაყოფა 1
print(24 / 3)
print(87 / 2)
print(89 / 4)

# გაყოფა 2
print(56 // 12)
print(78 // 6)
print(26 // 12)

print(50 % 32)
print(72 % 6)
print(29 % 12)

# დავალება 2
# ცვლადის შექმნის დროს უნდა გავითვალისწინოთ რომ წინ არ უნდა მივუწეროთ ციფრი (აუცილებლად ბოლოში)
# არ უნდა იყოს გამოტოვება და სხვა რაღაცები მაგალითად !@$$% ესენი არ უნდა იყოს გამოყენებული
# (თორე error გამოიტანს)


