# Level 06
# 1) მომხარებელს შემოატანინეთ 2 ცალი რიცხვი სხვადასხვა დამოუკიდებელი input-ის მეშვეობით,
#  ამის შემდეგ კი უბრალოდ დაბეჭდეთ ამ შემოყვანილი რიცხვების ჯამი. (დაგჭირდებათ int() ფუნქცია)
# 2) მომხმარებელს შემოატანინეთ თავისი ასაკი, თქვენი დავალებაა შემოყვანილი მნიშვნელობა გადაიყვანოთ integer ტიპის მონმაცემად და მომხმარებელს დაუბეჭდოთ ასაკი 15 წლის შემდეგ.
# 3) გააკეთეთ თითო მარტივი მაგალითი თითო შედარების ოპერატორზე.
# 4) გააკეთეთ ასევე 2-2 მაგალითი თითო ლოგიკურ ოპერატორზე.

# num_1 = int(input("enter your first num"))
# num_2 = int(input("enter your second num"))

# print(num_1 + num_2)
# 2)
age = int(input("enter your age"))
print(age + 15)
# 3)
print(1 < 1)
print(4 > 2)
print(6 <= 3)
print(2 >= 9)
print(3 != 0)
# 4)
print(1 or 1)
print(23 or 12)
print(4 and 2)
print(10 and 3)
