# 2) კომენტარების სახით ახსენით რამდენი ნაწილისგან შედგება კოდის წერის პროცესი და განმარტეთ თითოეული.
# 3) ივარჯიშეთ და გააკეთეთ მაგალითები მათემატიკურ ოპერატორებზე, განსაკუთრებით დღევანდელ გაკვეთილზე ახსნილ ოპერატორებზე.
# 4) ახსენით რა განმარტებაა / და // გაყოფას შორის.
# 5) კომენტარების სახით ახსენით რა არის case-sensitive და case-insensitive პროგრამირების ენები.
# 6) შექმენით 5 სხვადასხვა ცვლადი. ცვლადებში შეინახეთ თქვენთვის სასურველი მნიშვნელობები და შემდეგ დაბეჭდეთ ერთი დიდი წინადადება ერთი print() ფუნქციის მეშვეობით
# 7) შექმენით სამი ცვლადი num1, num2 და num3, შემდეგ კი დაპრინტეთ მათი ჯამი, სხვაობა, ნამრავლი, განაყოფი terminal-ში.

# 1) სამი პროცესისაგან შედგება თვითონ წერა კოდის გაშვება და დებაგინგი კოდის წერა
# არის თვითონ პროცესი ანუ შექმნა გაშვება არის შემოწმება რაიმე ხარვეზი ხოარ აქვს ხოლო
# დებაგინგი არის შემოწმების პროცესი ანუ გამოსწორება

# 2) 

print(40 + 29)
print(21 + 11)
print(400 + 9832)
print(10 - 2)
print(80 - 9)
print(144 - 99)
print(40 * 2)
print(123 * 29)
print(454 * 89)
print(24 ** 2)
print(42 ** 29)
print(420 ** 9)
print(412 / 79)
print(410 / 98)
print(40 /2)
print(4014 // 34)
print(40 // 29)
print(124 // 12)
print(42 % 4)
print(930 % 23)
print(620 % 239)

# 3) ერთ ერთს მთელებში აყვს რიცხვუ მეორე კი ამრგვალებს ანუ მაგალითად თუ პახუხია 1.23249682 ორ ნიშნიანი
# გაყოფა ესე დაწერს 1
# 4)  case-sensitive ენაში age Age განსვავებულია ანუ დიდ მნიშვნელობას აქცევს  case-sensitive დიდი ასოთი იწყება სიტყვა თუ არა ხოლო
# case-insensitive  ენაში მნიშვნელობა არ აქ
# 5)
name = "Tekla"
age = 11
lastname = "kapanadze"
dog = "Tobi"
color = "pink,yellow"

print("hallo my name is",name,"my Lastname is",lastname,"my fav color is",color,"and i have cutest dog his name is",dog,"bye")

num_1 =67
num_2 = 16
num_3 = 24

print(num_1 + num_2 + num_3)
print(num_1 - num_2 - num_3)
print(num_1 * num_2 * num_3)
print(num_1 / num_2 / num_3)