# 2) კომენტარების სახით ახსენით თუ რა დანიშნულება აქვთ .append(); .insert() და .pop() ფუნქციებს.

# 3) შექმენით რამდენიმე ელენტისგან შემდგარი სია, თქვენი დავალებაა დაბეჭდოთ ამ სიის სიგრძე, ანუ სიაში არსებული ელემენტების რაოდენობა.

# 4) შექმენით ხარიელი სია სადაც მომხმარებელს 5-ჯერ შემოატანინენებთ რიცხვს, შემდეგ კი დაამატებთ მას სიის ბოლოში append() ფუნქციით.

# 5) მოცემულია სია:
# colors = ["red", "green", "blue", "yellow", "purple"]
# თქვენი დავალებაა სიიდან წაშალოთ ბოლო ელემენტი .pop() მეთოდის დახმარებით, შემდეგ კი დაბეჭდოთ განახლებული სია.

# 6) მოცემულია სია:
# animals = ["dog", "cat", "elephant", "lion"]
# თქვენი დავალებაა insert() მეთოდით ჩასვათ სიტყვა "monkey" სიაში მეორე პოზიციაზე, რის შემდეგაც დაბეჭდავთ განახლებულ სიას.

# 7) შემქნით ცარიელი სია, სადაც 3-ჯერ input-ის სახით მომხმარებელს შეაყვანინებთ სამი სტუდენტის სახელს და დაამატებთ სიაში append() ფუნქციით. შემდეგ კი ჩასვით "Teacher" სიის თავში, წაშალეთ ბოლო სტუდენტი და დაბეჭდეთ სიის სიგრძე, ასვეე საბოლოო სია.

# 8) წაიკითხეთ დამატებითი ინფორმაცია დღეს განვლილ საკითხებზე:

# 1
# append სიაში ელემენტს ბოლოში ამატებს
# insert სიაში ელემენტს სადაც გვინდა იქ ამატებს
# pop სიიდან შლის ელემენტს ჩვეულებრივ ბოლოს
# 2
# numbers = [10, 20, 30, 40, 50]
# print(len(numbers))
# 3
# numbers = []

# for i in range(5):
#     num = int(input("seiyvane ricxvi"))
#     numbers.append(num)

# print(numbers)

# 4
# colors = ["red", "green", "blue", "yellow", "purple"]
# colors.pop()
# print(colors)

# 5)
# animals = ["dog", "cat", "elephant", "lion"]
# animals.insert(1, "monkey")
# print(animals)
# # 6
# students = []

# for i in range(3):
#     students.append(input())

# students.insert(0, "Teacher")
# students.pop()

# print(len(students))
# print(students)

