# 2) ლოგიკური ოპერატორებისა და შედარების ოპერატორებზე შეადგინეთ 10 მაგალითი, 5 მაგალითმა უნდა დააბრუნოს False და 5 მაგალითმა უნდა დაააბრუნოს True
# 3) კომენტარის სახით დაწერეთ თუ რა არის sequancing, iteration, selection აღწერეთ თითეული მათგანი თქვენი სიტყვებით
# 4) კომენტარის სახით ახსენით თუ რა არის for loop და რაში გვეხმარება ის
# 5) კომენტარის სახით ახსენით თუ რა გადაეცემა range() ფუნქციას და როგორ მუშაობს for loop range-სთან თანხვედრაში
# 7) შენი დავალებაა ტერმინალში გამოიყანო საყვარელი ავტომობილის სახელი 10-ჯერ
# 8) შენი დავალებაა ტერმინალში გამოიტანო შენი გვარი 100 ჯერ
# 9) შენი დავალებაა ტერმინალში გამოიტანო საყვარელი ფერი 46 ჯერ
# 10) შენი დავალებაა ტერმინალში გამოიტანო შენი სახელის პირველი ასო 32 ჯერ
# 11) კარგი იქნება თუ თავიდან უყურებთ დღევანდელი გაკვეთილის ჩანაწერს ❤️

#False
print(9 < 1)
print(10 < 2)
print(11 < 3)
print(12 < 4)
print(13 < 5)

# True
print(9 > 1)
print(10 > 2)
print(11 > 3)
print(12 > 4)
print(13 > 5)

# 2)
#  1) Sequencing (თანმიმდევრობა) კოდი სრულდება რიგით, ზემოდან ქვემოთ, ნაბიჯ-ნაბიჯ
# Iteration (გამეორება) ერთი და იგივე კოდი ბევრჯერ სრულდება 
# Selection (არჩევა)პროგრამა ირჩევს რა გააკეთოს პირობის მიხედვით
# 3)
# for loop ი გვეხმარება იმაში რომ რამდენჯერაც ვეტყვით კოდს რომ განმეორდეს რომ განმეორდეს
# 4)
# სამი ფუნქცია გადაეცემა stop i stepi start  ი
# 5)
for i in range (11):
    print("Tekla")

# 6)
for i in range (101):
    print("kapanadze")    

# 7)
for i in range (47):
    print("pink,yellow")

# 8)

for i in range (33):
    print("T")
