# class work
# 1) კომენტარების გამოყენებით ახსენით თუ რაში ვიყენებთ კომენტარებს
# 2) კომენტარების გამოყენებით ახსენით თუ რაში ვიყენებთ ცვლადებს მოიყვანეთ ერთი მაგალითი
# 3) შექმენი ორი ცვლადი num1,num2 და თიოთეულში შეინახე სხვადასხვა რიხცვი
# 4) წინა დავალებაში შექმნილი ცვლადების გამოყენებით გააკეთე მათემატიკური ოპერაციები(+ , - , * , / )


# დავალება 1
# კომენტარები არის პატარა საშუალება რისი მეშვეობითად ჩვენ შეგვიძლია ესე რომ ვთქვათ დავმალოთ ვისუალ სტუდიოსთვის
# წარწერები ( ან თუნდაც კოდი)

# დავალება 2
# ცვალდი არის პატარა ყუთი რომელშიც შეგვიძლია შევინახოთ ინფორმაცია და როდესაც შეგვიძლია
# შემდეგ გამოვიყენოთ მაგალითად
#  # name = Tekla

# დავალება 3

# num_1 = 60
# num_2 = 50

# დავალება 4
print(60 * 50)
print(50 / 60 )