# 2) კომენტარების სახით თქვენი სიტყვებით კიდევ ერთხელ ახსენით ყველა მონაცემთა ტიპი (string, integer, float)
# 3) კომენტარების სახით თქვენი სიტყვებით ახსენით რა არის ცვლადი და რაში ვიყენებთ მათ.
# 4) print() ფუნქციის დახმარებით დაბეჭდეთ 5 string ტიპის მნიშნელობა, 5 integer ტიპის მნიშვნელობა, 5 float ტიპის მნიშვნელობა.
# 5) შექმენით 5 სხვადასხვა ცვლადი. ცვლადებში შეინახეთ თქვენთვის სასურველი მნიშვნელობები და შემდეგ დაბეჭდეთ შენახული მნიშვნელობები შესაბამისი დასახელებით.
# 6) გააკეთეთ 3-3 მაგალითი გაკვეთილზე ნასწავლ ყველა მათემატიკურ ოპერაციებზე.

# 1) str არის მონაცემი რომელიც ბრჭყალებშია ჩასმული
# int არის მთელი რიცხვი
# float არის ათწილადი რიცხვი
# 2) ცვლადი არის პატარა ყუთისავით რომელშიც ვდებთ ინფორმაციას და როცა გვინდა ამის ამოღება უნრალოდ
# ვპრინტავთ იმ სახელს რომელ ყუთშიდაც ჩავდეთ
# 3)
print("5")
print("5")
print("5")
print("5")
print("5")

print(5)
print(5)
print(5)
print(5)
print(5)

print("1.423")
print("5.123")
print("1.4553")
print("8.1234325")
print("1.12324142")
# 4)
age = 67
print(age)
# 5) 
print(40 + 29)
print(21 + 131)
print(40 + 2932)

print(13 - 12)
print(40 - 9)
print(134 - 29)

print(40 * 29)
print(410 * 2139)
print(130 * 29)

print(2434 ** 223)
print(4012 ** 219)
print(40 ** 29)

print(4012 / 49)
print(410 / 21)
print(420 /2)

print(4014 // 34)
print(40 // 29)
print(134 // 2)

print(4342 % 49)
print(900 % 293)
print(60 % 29)
