# 2) დაატრიალეთ for ციკლი 0 დან 38 ის ჩათვლით და გამოიტანე თითოეული რიცხვი ტერმინალში 

# 3) დაატრილეთ for ციკლი 30 დან 40 მდე და გამოიტანე თითოეული რიცხვი ტერმინალში
 
# 4) დაატრიალეთ for ციკლი 12 იდან 120 მდე და გამოიტანე თითოეული რიცხვი ტერმინალში

# 5) დაატრიალეთ for ციკლი და გამოიტანეთ თქვენი სახელი 21 ჯერ.

# 6) დაატრიალეთ for ციკლი 10 დან 100 მდე 3 step ის გამოტოვებით და გამოიტანეთ თითოეული რიცხვი ტერმინალში

# 7) ტერმინალში გამოიტანეთ თქვენი საყვარელი ხილის სახელი 30 ჯერ და თან დანომრეთ, მიიღეთ ქვემოთ მოცემულის ნაირი შედეგი

# 1 ფორთოხალი
# 2 ფორთოხალი
# 3 ფორთოხალი
# 4 ფორთოხალი
# 5 ფორთოხალი
# .... 
# ....
# ....
# 30 ფორთოხალი

# 7) მომხმარებელს შემოატანინეთ მისი ასაკი 13 ჯერ გამოიყენე for loop

# 8) გამოიტანეთ თქვენი სახელი 10 ჯერ while loop ის გამოყენებით

# 9) დაითვალეთ 0 დან 24 მდე გამოიყენეთ while loop

# 10) იმუშაოვეთ ბევრი for და while loop ებზე მოიყვანეთ თქვენით მაგალითები სურვილისამებრ
# 2)
for i in range(0,39):
    print(i)
# 3)
for e in range(30,41):
    print(e)
# 4)
for i in range(12,121):
    print(i)
# 5)
for i in range(22):
    print("Tekla")

# 6)
for i in range(10, 101, 3):
    print(i)
# 7)
print("pomelo")    
for i in range(31):
    print("pomelo")
# 7)
age = input('enter your age')
for i in range(14):
    print(age)
# 8)

count = 0

while count < 10:
    print("Tekla")
    count += 1

# 9)
number = 0

while number <= 24:
    print(number)
    number += 1    
    