# 1) კომენტარებით ახსენით რა არის input და output და რეალურ ცხოვრებიდან მოიყვანეთ მაგალითი

# 2) კომენტარებით ახსენით თუ რა არის კონკატინაცია და მოიყვანეთ 1 მაგალითი

# 3) input() - ის გამოყენებით მომხმარებელს შემოაყვანინე სახელი და შეინახე ცვლადში

# 4) შექმენი 3 ცვლადი name, lastname, age და შემოაყვანინე თითოელი მნიშვნელობა და შეინახე ცლადში და 
# შემდეგ დაპრინტე შენდეგი წინადადება: გამარჯობა name lastname შენ ხარ age წლის! (აუცილებლად გამოიყენეთ კონკატინაცია)
#1)
#  input ი არის მაგალითად ბანკომატისავით ანუ როცა შეგიძლია ფული შეიტანო შიგნით ადნუ უფრო მარტივათ
# რომ ვთქვათ input ი არის კოდი რომელშც ადამიანი უთიტებს სახელს გვარს ან ნებისმიერ მონაცემს
# ხოლო რაც შეხება output ს ოუთფუტი შეგვიძლია შევადაროთ ისევე ბანკომატს მაგალითად როდესაც ჩვენ მივუთითებთ
# ჩვენ სახელს ბანკომატში შემდეგ მაგალითად ხომ გამოგვიტანს თქვენი სახელია თეკლა აი სწორედ ის წინადადება იქნება
# output ი
# 2)
name = "Tekla"
lastname = "kapanadze" 
print(name, lastname)
# 3)
name = print(input("enter your name"))
print(name)
# 4)
name="tekla"
lastname= "kapanadze"
age=11
print("hallo", name, lastname ,"you are", age, "year" )