# 1) მომხმარებელს შემოატანინეთ ამინდი და თუ ის არის "მზიანი" - დაბეჭდეთ
# "ვივარჯიშებ გარეთ", სხვა შემთხვევაში თუ "მოღრუბლული"-ა მაშინ დაბეჭდეთ "ვივარჯიშებ გარეთ ოღონდ მოგვიანებით",
# ხოლო სხვა დანარჩენ შემთხვევაში დაბეჭდეთ "საერთოდ არ ვივარჯიშებ დღეს"
# 2) თქვენი დავალებაა შექმნათ ე.წ "smart search" სისტემა, რომელიც 1-დან 1000-მდე რიცხვების
# ჩამონათვალში, თუ იპოვის რიცხვ 461ს ავტომატურად გაწყვიტავს მუშაობას, ანუ დაასრულებს შემოწმებას.
# 3) თქვენი დავალებაა შექმნათ რიცხვების ჩამონათვალი 1-დან 100-მდე, ამ რიცხვების ჩამონათვალში
# უნდა იპოვოთ პირველი რიცხვი, რომელიც უნაშთოდ გაიყოფა 2-ზეც, 3-ზეც და 5-ზეც. როდესაც იპოვით ასეთ რიცხვს,
# ავტომატურად დაბეჭდეთ ის და დაასრულეთ აქ ციკლის მუშაობა.
# 1)
amindi = input("dawere amindi: ")

if amindi == "mze":
    print("vivarjiseb garet")
elif amindi == "mogrubluli":
    print("vivarjiseb garet ogont mogvianebit")
else:
    print("saertod ar varjisob")

# 2)
for number in range(1, 1001):
    print(number)

    if number == 461:
        print("ricxvi 461 napovnia")
        break

# 3)
for number in range(1, 101):
    if number % 2 == 0 and number % 3 == 0 and number % 5 == 0:
        print("pirveli ricxvia", number)
        break