# 1) მოცემულია რიცხვების სია. გამოიყენეთ slicing, რომ ამოიღოთ სიიდან პირველი 3 რიცხვი.
# -- numbers = [10, 20, 30, 40, 50, 60, 70] --

# 2) მოცემულია string-ი. slicing-ის გამოყენებით ამოჭერით მხოლოდ სიტყვა "World".
# -- text = "Hello, World!" --

# 3) მოცემულია ფერების სია. გამოიყენეთ უარყოფითი ინდექსები, რათა სიიდან ამოიღოთ ბოლო 2 ფერი.
# -- colors = ["წითელი", "მწვანე", "ლურჯი", "ყვითელი", "შავი"] --

# 4) მოცემული გაქვთ რიცხვების სია, რომელშიც არის ჩაშენებული მხოლოდ integer მონაცემთა ტიპის მნიშნელობები (ანუ რიცხვები). თქვენი დავალებაა for ციკლის გამოყენებით დაბეჭდოთ და გაიგოთ ამ სიაში შემადგენელი რიცხვების ჯამი.
# -- short_nums = [1,2,3,4,90,8,72,31,74] --

# 5) FINAL SUPER ULTRA DUPER MEGA BOSS:
# მოცემული გაქვთ რიცხვების სია, თქვენი დავალებაა გაიგოთ სიაში ყველაზე დიდი რიცხვი შესაბამისი ხრიკების გამოყენებით, მხოლოდ ნასწავლი მასალით რა თქმა უნდა. (პირდაპირ index-ით მნიშვნელობის გამოტანა აკრძალულია!!!)
# get_highets = [90,81,100,23,3,98,102,90,75]

# 1)
# numbers = [10, 20, 30, 40, 50, 60, 70]

# first_three = numbers[0:3]
# print(first_three)

# # 2)
# text = "Hello, World!"
# world = text[7:12]
# print(world)

# # 3)
# colors = ["წითელი", "მწვანე", "ლურჯი", "ყვითელი", "შავი"]
# last_two = colors[-2:]
# print(last_two)

# # 4)
# short_nums = [1, 2, 3, 4, 90, 8, 72, 31, 74]
# total = 0
# for i in short_nums:
#     total += i
# print("ricxvebus jamia", total)

# # 5) egari situacuia daizaba

# get_highets = [90, 81, 100, 23, 3, 98, 102, 90, 75]
# highest = get_highets[0]

# for i in get_highets:
#     if i > highest:
#         highest = i

# print("yvelaze didi ricxvia", highest)