# 2) კომენტარების სახით ახსენით რამდენი ნაწილისგან შედგება კოდის წერის პროცესი და განმარტეთ თითოეული.
# 3) ივარჯიშეთ და გააკეთეთ მაგალითები მათემატიკურ ოპერატორებზე, განსაკუთრებით დღევანდელ გაკვეთილზე ახსნილ ოპერატორებზე.
# 4) ახსენით რა განმარტებაა / და // გაყოფას შორის.
# 5) კომენტარების სახით ახსენით რა არის case-sensitive და case-insensitive პროგრამირების ენები.
# 6) შექმენით სამი ცვლადი num1, num2 და num3, შემდეგ კი დაპრინტეთ მათი ჯამი, სხვაობა, ნამრავლი, განაყოფი terminal-ში.
# 7) კომენტარების სახით ახსენით რა არის snake_case წერის სტილი და როგორ ხდება ჩანაწერების გაკეთება.
# 8) აუცილებლად უყურეთ გაკვეთილის ჩანაწერს


# 2) 3 ძირითადი ნაწილისგან შედგება კოდის დაწერა გაშვება ხოლო შემდეგ კი თუ რაიმე შეცდომა მაქვს მის გამოსწორების
# გზებს ვეძებთ
# 3) 
print(50 + 80)
print(45 - 15)
print(38 / 28)
print(50 // 20)
print(20 * 91)
print(50 ** 80)
print(90 % 81)
# 4) / ამ გაყოფას რიცხვი მთელებშ აყავს მაგალითდ 1.274942584 ანუ ეს დაწერს დახლოებით ასე ანუ მთელებშ აიყვანს ხოლო
# // ეს  დამრგვალებს რიცხვს და დამრგვალებულს გამოიტანს
# 5) case-sensitive არის როდესაც დიდი და პატარა ასო განსხვავდება და პროგრამა ორივეს სხვადასხვანაირად აღიქვამს
#  მაგალითად  name და Name 
# ხოლო  case-insensitive არის ერთნაირად რომ აღიქვამს გინდ დიდი ასო იყოს გინდ პატარა
# 6)
num_1 = 67
num_2 = 90
num_3 = 31

print(num_1 + num_2 + num_3)
print(num_1 - num_2 - num_3)
print(num_1 // num_2 // num_3)
print(num_1 ** num_2 ** num_3)

# 7) snake_case არის როდესაც სიტყვები _ გამოიყოფა მაგალითად home_work აქ შუაში გამოვიყენე snake_case ანუ _