# 1) გააკეთეთ თითო მაგალითი თითო მათემატიკურ ოპერატორზე. ანუ ერთი მაგალითი ერთ ოპერატორზე.
# 2) შექმენით 5 ცვლადი -->
# პირველ ცვლადში შეინახეთ ინფორმაცია თქვენი სახელის შესაახებ.
# მეორე ცვლადში შეინახეთ ინფორმაცია თქვენი ასაკის შესახებ.
# მესამე ცვლადში შეინახეთ ინფორმაცია თქვენი საყვარელი ფერის შესახებ.
# მეოთხე ცვლადში შეინახეთ ინფორმაცია თქვენი საყვარელი მანქანის შესახებ.
# მეხუთე ცვლადში შეინახეთ ინფორმაცია თქვენი ქალაქის შესახებ, რომელშიც ცხოვრობთ.
# main task: ააგეთ ერთი დიდი წინადადება ცვლადების დახმარებით როგორც გაკვეთილზე მაგალითის სახით გავაკეთეთ.
 
# 1)
print(11 + 23)

print(2421 - 54)

print(24 * 23)

print(131 ** 243)

print(111 / 2343) 

print(1123 // 223)

print(11 % 23)

# 2)
name = "Tekla"
age = 11
fav_color = "yellow,pink"
fav_car = "mercedes (brabusi)"
qalaqi = "Tbilisi"

print("hallo my name is", name , "my age is",age,"my fav color is",fav_color,"my fav car is",fav_car,"i live in",qalaqi)
