# 2) კომენტარებით ახსენით თუ რა არის custom ფუნქციები, რისთვის გამოვიყენებთ და 
# რა დანიშნულება გააჩნიათ, ასევე ახსენით მისი შექმნის გზები ეტაპობრივად და ახსენეთ თუ რაა პარამეტრები და არგუმენტები.

# 3) შექმენით ფუნქცია, რომელსაც გადაეცემა ორი რიცხვი. თქვენი დავალებაა დააბრუნოთ ამ ორი რიცხვის ჯამი.

# 4) შექმენით ფუნქცია, რომელსაც გადაეცემა 1 რიცხვი. თქვენი დავალებაა შეამოწმოთ
#  ამ რიცხვის ლუწობა. თუ იგი ლუწია, დაბეჭდეთ "რიცხვი ლუწია" სხვა შემთხვევაში "რიცხვი კენტია"

# 5) შექმენით ფუნქცია, რომელსაც გადაეცემა 1 რიცხვი. თქვენი დავალებაა დააბრუნოთ 
# ამ რიცხვის კვადრატული მნიშნელობა.

# 6) შექმენით ფუნქცია, რომელიც გადაცემულ ტექსტს აბრუნებს დიდი ასოებით.

# 7) შექმენით ფუნქცია, რომელსაც პარამეტრებად გადაეცემა სახელი და გვარი,
#  თქვენი დავალებაა გამოიტანოთ მნიშვნელობები ერთი წინადადების სახით.


# 1
# Custom ფუნქცია არის პროგრამისტის მიერ შექმნილი ფუნქცია
# რომელიც გამოიყენება კოდის გამეორების თავიდან ასაცილებლად 
# და კონკრეტული დავალების შესასრულებლად; მისი შექმნა ხდება
# def სიტყვის ფუნქციის სახელის პარამეტრების და კოდის ბლოკის
# დაწერით ხოლო პარამეტრი არის ფუნქციაში მითითებული ცვლადი
# არგუმენტი კი ფუნქციის გამოძახებისას გადაცემული კონკრეტული მნიშვნელობა

# 2
# def sum_numbers(a, b):
#     return a + b

# result = sum_numbers(5, 3)

# print(result)

# 3
# def check_even(number):
#     if number % 2 == 0:
#         print("ricxvi luwia")
#     else:
#         print("ricxvi kentia")


# check_even(7)

# 4
# def square(number):
#     return number ** 2
# result = square(5)

# print(result)

# 5

# def to_upper(text):
#     return text.upper()
# result = to_upper("hello")

# print(result)

# 6
# def full_name(name, surname):
#     print("cemi saxelia", name, surname)

# name = "Tekla"
# surname = "Kapanadze"

# full_name(name, surname)